-- MySQL dump 10.13  Distrib 8.0.38, for Win64 (x86_64)
--
-- Host: localhost    Database: ordering
-- ------------------------------------------------------
-- Server version	8.0.39

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `tmp`
--

DROP TABLE IF EXISTS `tmp`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tmp` (
  `id` int DEFAULT NULL,
  `name` text,
  `addr` text,
  `memo` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tmp`
--

LOCK TABLES `tmp` WRITE;
/*!40000 ALTER TABLE `tmp` DISABLE KEYS */;
INSERT INTO `tmp` VALUES (1,'Cf노래방(B1)','연수동611-14',NULL),(2,'G샵 청학(1F)','청학동496-1','주방안'),(3,'KBS노래방(B1)','연수동607-4',NULL),(4,'KCO(B1)','연수동630-7',NULL),(5,'MBC노래방(B1)','연수동611-15','계단'),(6,'OK노래방 영남(B1)','연수동558-5','문앞'),(7,'OK노래방 청학(2F)','청학동496-4','비상구좌측 실외기'),(8,'가시식당(1F)','연수동613-5',NULL),(9,'개구리노래방(B1)','연수동601-16','계단위나 매장'),(10,'고래고래노래방(B1)','연수동621-2',NULL),(11,'공가네장어(1F)','연수동623-2','어항뒤'),(12,'공개홀(B1)','연수동630',NULL),(13,'궁노래방 영남(2F)','연수동604-11',NULL),(14,'궁노래방(B1)','연수동604-11',NULL),(15,'까치(B1)','연수동612-8','계단밑좌측 문'),(16,'나인노래방(3F)','연수동598-4','계단'),(17,'냠냠1지사','연수동609-8',NULL),(18,'노르웨이숲(2F)','연수동625-13','매장안휴게실박스'),(19,'놀러와클럽 청학(B1)','청학동500',NULL),(20,'놀이터(2F)','연수동598-3','문밖테이블'),(21,'다모아노래방 청학(B1)','청학동487-2','주차장뒤'),(22,'대동노래방(B1)','연수동618-8','화장실앞'),(23,'대통노래방(B1)','연수동611-5',NULL),(24,'더노래방(4F)','연수동598-6','엘베 정면 계단'),(25,'동남 영남(B1)','연수동556-9',NULL),(26,'디바라이브(2F)','연수동601-16','문앞'),(27,'딱좋아라이브 청학(B1)','청학동487-4','계단밑테이블'),(28,'딱좋아호프(1F)','연수동621','매장혹은문밖'),(29,'딸기노래방(B1)','연수동604','입구안 오른쪽 눈높이'),(30,'락휴(2F)','연수동598-6','엘베 옆'),(31,'럭셔리노래방 청학(B1)','청학동496','매장앞소화전내'),(32,'레테빠(2F)','연수동606-2','주방'),(33,'로즈빠(2F)','연수동604-12','계단'),(34,'루비노래방(B1)','연수동608-7',NULL),(35,'리즈노래방(B1)','연수동604-8',NULL),(36,'리틀시티(B1)','연수동602-6',NULL),(37,'링코노래방(3F)','연수동598-15',NULL),(38,'마세라티(1F)','연수동628-2',NULL),(39,'마이콜노래방(B1)','연수동607-11','늦게오픈'),(40,'만남노래타운(B1)','연수동598',NULL),(41,'메탈리카(B1)','연수동628-12',NULL),(42,'명가노래방(B1)','연수동609-6',NULL),(43,'명품 4단지(B1)','연수동521-10',NULL),(44,'명품노래방 동춘(B1)','동춘동934-4','골목쪽계단'),(45,'명품노래방 청학(B1)','청학동484-1',NULL),(46,'명품노래방(B1)','연수동606','계단'),(47,'모조빠(2F)','연수동597-3',NULL),(48,'문노래방(B1)','연수동604-12',NULL),(49,'뮤즈빠(2F)','연수동606-3',NULL),(50,'미스짱(B1)','연수동612-13','계단밑창고'),(51,'바다노래방(B1)','연수동608',NULL),(52,'발렌타인빠(3F)','연수동598-15',NULL),(53,'발리빠(B1)','연수동606-8',NULL),(54,'벤츠노래방(B1)','연수동612-12',NULL),(55,'별밤(2F)','연수동592',NULL),(56,'보물섬(3F)','연수동595-2',NULL),(57,'불가리라이브(2F)','연수동598-10',NULL),(58,'브라보라이브(7F)','연수동598','엘베 오른쪽 문열고 계단'),(59,'블랙엔화이트(1F)','연수동629-1','매장옆 길가'),(60,'블루문라이브(B1)','연수동631',NULL),(61,'블리스빠(1F)','연수동608-2',NULL),(62,'블링크빠(1F)','연수동629-10',NULL),(63,'비비노래방(B1)','연수동601-17',NULL),(64,'비타민노래방(B1)','연수동611-11','계단밑테이블'),(65,'빈센트라이브(B1)','연수동606-11','주방냉장고'),(66,'삐삐노래방(B1)','연수동604-13','매장문앞좌측문'),(67,'샛별노래방 청학(B1)','청학동486-2',NULL),(68,'샤론빠 4단지(B1)','연수동488',NULL),(69,'샤샤노래방(B1)','연수동621-1','계단밑우측'),(70,'샤인라이브(B1)','연수동605-6','주방'),(71,'샾노래방(B1)','연수동611-10','계단밑주방입구'),(72,'세계맥주 4단지(B1)','연수동503-4',NULL),(73,'소리새노래방 동춘(4F)','동춘동934-8',NULL),(74,'소판돈(B1)','연수동574-6',NULL),(75,'소풍라이브(B1)','연수동629-1',NULL),(76,'솔노래방(1F)','연수동611-7','실외기'),(77,'쉬즈노래방(B1)','연수동611-6',NULL),(78,'슈가노래방(2F)','연수동612',NULL),(79,'슈퍼모델클럽 청학(B1)','청학동497-7','매장앞계단'),(80,'스카이당구장(5F)','연수동598-2',NULL),(81,'스타노래방 동춘(4F)','동춘동933-14',NULL),(82,'시마라이브(B1)','연수동628-9',NULL),(83,'신화노래방 청학(B1)','청학동489-5','계단밑'),(84,'싼타페노래방 동춘(3F)','동춘동933-12',NULL),(85,'쌍쌍 영남(B1)','연수동565-5',NULL),(86,'써니라이브(B1)','연수동624-5',NULL),(87,'썸노래방(2F)','연수동596-7','매장안 냉장고'),(88,'썸라이브(B1)','연수동624-2',NULL),(89,'쎄시봉라이브(B1)','연수동624-1',NULL),(90,'씽씽노래방(2F)','연수동598-6',NULL),(91,'아랑라이브(B1)','연수동620-8',NULL),(92,'아우디 청학(2F)','청학동497-8','매장밑테이블'),(93,'아우디빠(1F)','연수동623-1',NULL),(94,'안빠(2F)','연수동604-11','계단'),(95,'압구정노래방(B1)','연수동611-9',NULL),(96,'앤서빠(1F)','연수동628-7','매장주방'),(97,'야수노래방(2F)','연수동598-3','문밖'),(98,'엔돌핀노래방 청학(B1)','청학동470-2','입구전펜스'),(99,'여우라이브(B1)','연수동626','계단맡테이블'),(100,'연예인노래방(3F)','연수동598-7',NULL),(101,'열린노래방 청학(B1)','청학동487-6',NULL),(102,'열창노래방 청학(B1)','청학동495-5',NULL),(103,'오뚜기노래방(B1)','연수동606-12',NULL),(104,'오렌지 영남(B1)','연수동564-4',NULL),(105,'오로라빠(2F)','연수동624',NULL),(106,'오빠닭(1F)','연수동611-9','문열고 우측'),(107,'오페라노래방(B1)','연수동611-13','계단밑좌측 문'),(108,'올드클락(2F)','연수동626-13',NULL),(109,'와썸(B1)','연수동598-8',NULL),(110,'와와 영남(B1)','연수동574-6',NULL),(111,'와와노래방(B1)','연수동604-10',NULL),(112,'와와노래방(B1)공원','연수동609-5',NULL),(113,'와우 4단지(B1)','연수동522',NULL),(114,'우쥬비어(1F)','연수동628-3',NULL),(115,'원피스(B1)','연수동595-2','계단밑맥주박스'),(116,'웰빙노래방(B1)','연수동618-9','계단'),(117,'윈드라이브(B1)','연수동602-6',NULL),(118,'유라이브(B1)','연수동605-3',NULL),(119,'이글라이브(B1)','연수동628-10',NULL),(120,'인더그레이(B1)','연수동602','가게앞 길가'),(121,'인생극장(1F)','연수동608-4',NULL),(122,'자우림 동춘(4F)','동춘동934-11','문밖'),(123,'잠보노래방(B1)','연수동598-10',NULL),(124,'잠자리빠(2F)','연수동604-10',NULL),(125,'쟁반노래방 청학(B1)','청학동490-6',NULL),(126,'제이라이브(B1)','연수동624-3',NULL),(127,'준라이브우측문(4F)','연수동596-7','문앞'),(128,'줄리아라이브(3F)','연수동596-6',NULL),(129,'중년라이브(B1)','연수동621-6',NULL),(130,'쥬라기노래방(B1)','연수동598-6','매장내주방'),(131,'질러노래방(3F)','연수동598-15',NULL),(132,'짝꿍노래방 청학(B1)','청학동488-5',NULL),(133,'짝노래방 청학(B1)','청학동497-8',NULL),(134,'짝노래방(B1)','연수동607-13',NULL),(135,'짝라이브(2F)','연수동628-8',NULL),(136,'차차차노래방(B1)','연수동608-4','매장복도끝우측'),(137,'청춘라이브(B1)','연수동604-2',NULL),(138,'초이스라이브(B1)','연수동627-11',NULL),(139,'치에로빠(1F)','연수동629-9',NULL),(140,'치킨히어로(1F)','연수동627-10',NULL),(141,'친구카스호프(1F)','연수동623-1','매장혹은 문밖'),(142,'카라노래방(B1)','연수동607-2','계단밑우측문'),(143,'카리브라이브(B1)','연수동623-6',NULL),(144,'칸타타노래방 청학(2F)','청학동498','매장앞'),(145,'칼라노래방 청학(B1)','청학동495-8','계단밑테이블'),(146,'코리아노래방(B1)','연수동611-12',NULL),(147,'콘서트(B1)','연수동627-10',NULL),(148,'쿨노래방 4단지(B1)','연수동512-1',NULL),(149,'쿨노래방(B1)','연수동604-9',NULL),(150,'퀸노래방(B1)','연수동619-7',NULL),(151,'퀸라이브(B1)','연수동620-12',NULL),(152,'퀸빠(1F)','연수동628-4',NULL),(153,'큐노래방 동춘(2F)','동춘동933-15','끝방'),(154,'크리스탈(2F)','연수동606-11',NULL),(155,'클래식노래방(B1)','연수동611',NULL),(156,'태양노래방 청학(B1)','청학동489-6','가게옆 골목안'),(157,'테크노노래방(B1)','연수동611-8','계단밑우측창고'),(158,'템포노래방(B1)','연수동608-6',NULL),(159,'통기타라이브(B1)','연수동628-8',NULL),(160,'파티노래방(B1)','연수동612-11','계단밑'),(161,'파티라이브(B1)','연수동602-1',NULL),(162,'팡팡노래방(3F)','연수동598-3',NULL),(163,'포시즌노래방 동춘(2F)','동춘동934-2','매장이나계단밑'),(164,'폭스노래방(B1)','연수동612-10',NULL),(165,'풍차(B1)','연수동619-2','계단밑우측'),(166,'프로포즈(B1)','연수동601-6',NULL),(167,'핑클 영남(B1)','연수동570-12','입구'),(168,'하노이(3F)','연수동596-6',NULL),(169,'향수 4단지(B1)','연수동502-10',NULL),(170,'향수라이브(B1)','연수동602-7',NULL),(171,'화이트노래방(B1)','연수동619-9','계단밑테이블'),(172,'황제노래방 청학(B1)','청학동483-12','매장내계단'),(173,'휠링라이브(B1)','연수동602-3',NULL),(174,'희자매라이브(B1)','연수동601-15','냉장고'),(175,'힘찬스크린(6F)','연수동596-7','문밖이나 매장');
/*!40000 ALTER TABLE `tmp` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-08-31  3:50:28
